[
	"CNews said Mr Macron appeared “ready for battle, his gaze fixed on the punching bag as if determined to beat his opponents”.",
	"Nice-Matin, a regional French daily newspaper, said the images conveyed a message of “ultimate virility” that brought to mind those of a bare-chested Vladimir Putin practising judo or riding a horse.",
	"Satirists have had a field day over his Damascene conversion, with cartoons of him in military gear appearing.",
	"Satirists have had a field day over his Damascene conversion, with cartoons of him in military gear appearing. The latest images caused some admiration but mainly mirth on French social media. “He’s in Olympic form” four months from the Paris Games, wrote L’Essentiel.",
	"Some users suggested the president was trying to ape Robert De Niro in Raging Bull or Sylvester Stallone as Rocky Balboa. “Who has more flow and virility between Emmanuel Macron and Vladimir Putin? And who would win an MMA fight?” wrote one. Many suggested that Mr Macron must have had recourse to Photoshop to enlarge his biceps. “AI can do wonderful things,” said one commentator. Another Twitter user wrote: “I’m afraid of nothing, not even ridicule.",
	"Satirists have had a field day over his Damascene conversion, with cartoons of him in military gear appearing. The latest images caused some admiration but mainly mirth on French social media. “He’s in Olympic form” four months from the Paris Games, wrote L’Essentiel. Some users suggested the president was trying to ape Robert De Niro in Raging Bull or Sylvester Stallone as Rocky Balboa. “Who has more flow and virility between Emmanuel Macron and Vladimir Putin? And who would win an MMA fight?” wrote one. Many suggested that Mr Macron must have had recourse to Photoshop to enlarge his biceps. “AI can do wonderful things,” said one commentator. Another Twitter user wrote: “I’m afraid of nothing, not even ridicule.",
	"I am currently fighting\nAmerica's president Joe Biden and his friend Zelensky's army. I hate losing",
	" "
]